** Functions
YALL has a single namespace for both functions and variables so you
can store and call other functions.

functions are created with the lambda keyword followed by a list of
arguments and th body of the function
#+begin_src scheme
      (lambda (argOne argTwo) ; arguments
        (+ argOne argTwo))  ; body
#+end_src


We can store values using define

#+begin_src scheme
    (define double
      (lambda (a) (* a 2)))
#+end_src

#+RESULTS:

Then we can call the function just like any built in one

#+begin_src scheme
  (double 10)
#+end_src

#+RESULTS:
: 20

Since functions act as variables you can also pass them as arguments

This will partially apply the first argument 
#+begin_src scheme
  (define curry
       (lambda (fn arg)
         (lambda (y) (fn 1 y))))
#+end_src

#+begin_src scheme
  (curry + 1) ; a function 
#+end_src

#+begin_src scheme
  ((curry + 1) 2)
#+end_src

#+RESULTS:
: 3

** let

In addition can define new lexically scoped blocks using ~let~

#+begin_src scheme
  (let ((a 1)
        (b 2))
    (+ a b))
#+end_src

#+RESULTS:
: 3

Just like anything else you can also define functions in let
declarations.

